payload-stress-tests/jmeter.log
2025-03-29 04:24:04,560 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-03-29 04:24:04,611 INFO o.a.j.JMeter: Loading user properties from: /opt/jmeter/bin/user.properties
2025-03-29 04:24:04,612 INFO o.a.j.JMeter: Loading system properties from: /opt/jmeter/bin/system.properties
2025-03-29 04:24:04,628 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-03-29 04:24:04,630 INFO o.a.j.JMeter: Version 5.6.3
2025-03-29 04:24:04,630 INFO o.a.j.JMeter: java.version=21.0.6
2025-03-29 04:24:04,630 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-03-29 04:24:04,630 INFO o.a.j.JMeter: os.name=Linux
2025-03-29 04:24:04,630 INFO o.a.j.JMeter: os.arch=amd64
2025-03-29 04:24:04,630 INFO o.a.j.JMeter: os.version=6.8.0-1025-aws
2025-03-29 04:24:04,630 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-03-29 04:24:04,630 INFO o.a.j.JMeter: java.awt.headless=true
2025-03-29 04:24:04,630 INFO o.a.j.JMeter: Max memory     =536870912
2025-03-29 04:24:04,631 INFO o.a.j.JMeter: Available Processors =1
2025-03-29 04:24:04,659 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-03-29 04:24:04,661 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-03-29 04:24:04,661 INFO o.a.j.JMeter: JMeterHome=/opt/jmeter
2025-03-29 04:24:04,661 INFO o.a.j.JMeter: user.dir  =/root/playload-stresstest
2025-03-29 04:24:04,661 INFO o.a.j.JMeter: PWD       =/root/playload-stresstest
2025-03-29 04:24:04,663 INFO o.a.j.JMeter: IP: 172.31.15.56 Name: ip-172-31-15-56 FullName: ip-172-31-15-56.us-west-1.compute.internal
2025-03-29 04:24:04,665 INFO o.a.j.JMeter: user.classpath=../lib
2025-03-29 04:24:04,665 WARN o.a.j.JMeter: Can't read ../lib
2025-03-29 04:24:04,710 INFO o.a.j.s.FileServer: Default base='/root/playload-stresstest'
2025-03-29 04:24:04,719 INFO o.a.j.s.FileServer: Set new base='/root/playload-stresstest'
2025-03-29 04:24:05,240 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-03-29 04:24:05,332 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-03-29 04:24:05,339 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-03-29 04:24:05,350 INFO o.a.j.s.SaveService: Loading file: test-playload-stress-20MB-20users.jmx
2025-03-29 04:24:05,469 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-03-29 04:24:05,469 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-03-29 04:24:05,469 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-03-29 04:24:05,469 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-03-29 04:24:05,469 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-03-29 04:24:05,470 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-03-29 04:24:05,499 INFO o.a.j.JMeter: Creating summariser <summary>
2025-03-29 04:24:05,538 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-03-29 04:24:05,538 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-03-29 04:24:05,538 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-03-29 04:24:05,547 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-03-29 04:24:05,547 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-03-29 04:24:05,724 INFO o.a.j.r.ClassFinder: Will scan jar /opt/jmeter/lib/ext/jmeter-plugins-manager-0.20.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-03-29 04:24:05,876 INFO o.a.j.r.ClassFinder: Will scan jar /opt/jmeter/lib/ext/jmeter-plugins-perfmon-2.1.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-03-29 04:24:05,933 INFO o.a.j.JMeter: Running test (1743222245933)
2025-03-29 04:24:05,971 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Payload Stress Group (50 Users)
2025-03-29 04:24:05,971 INFO o.a.j.e.StandardJMeterEngine: Starting 20 threads for group Payload Stress Group (50 Users).
2025-03-29 04:24:05,971 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-03-29 04:24:05,971 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=20 ramp-up=60 delayedStart=false
2025-03-29 04:24:06,001 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-03-29 04:24:06,003 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-03-29 04:24:10,971 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-1
2025-03-29 04:24:12,850 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = ip-172-31-15-56
2025-03-29 04:24:12,869 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-03-29 04:24:12,873 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-03-29 04:24:12,873 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-03-29 04:24:12,873 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-03-29 04:24:12,873 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-03-29 04:24:13,971 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-2
2025-03-29 04:24:16,972 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-3
2025-03-29 04:24:19,971 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-4
2025-03-29 04:24:22,971 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-5
2025-03-29 04:24:25,972 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-6
2025-03-29 04:24:28,972 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-7
2025-03-29 04:24:30,128 INFO o.a.j.r.Summariser: summary +     29 in 00:00:24 =    1.2/s Avg:   269 Min:   183 Max:   470 Err:     0 (0.00%) Active: 7 Started: 7 Finished: 0
2025-03-29 04:24:31,971 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-8
2025-03-29 04:24:34,975 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-9
2025-03-29 04:24:37,972 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-10
2025-03-29 04:24:40,972 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-11
2025-03-29 04:24:43,972 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-12
2025-03-29 04:24:46,973 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-13
2025-03-29 04:24:49,974 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-14
2025-03-29 04:24:54,583 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-15
2025-03-29 04:24:55,173 INFO o.a.j.t.JMeterThread: Thread finished: Payload Stress Group (50 Users) 1-3
2025-03-29 04:24:55,311 ERROR o.a.j.JMeter: Uncaught exception in thread Thread[#29,Payload Stress Group (50 Users) 1-3,5,main]
java.lang.OutOfMemoryError: Java heap space
	at java.base/java.util.Arrays.copyOf(Arrays.java:3541) ~[?:?]
	at java.base/java.io.ByteArrayOutputStream.ensureCapacity(ByteArrayOutputStream.java:100) ~[?:?]
	at java.base/java.io.ByteArrayOutputStream.write(ByteArrayOutputStream.java:132) ~[?:?]
	at org.apache.jmeter.protocol.http.sampler.HTTPSamplerBase.readResponse(HTTPSamplerBase.java:1969) ~[ApacheJMeter_http.jar:5.6.3]
	at org.apache.jmeter.protocol.http.sampler.HTTPAbstractImpl.readResponse(HTTPAbstractImpl.java:475) ~[ApacheJMeter_http.jar:5.6.3]
	at org.apache.jmeter.protocol.http.sampler.HTTPHC4Impl.sample(HTTPHC4Impl.java:678) ~[ApacheJMeter_http.jar:5.6.3]
	at org.apache.jmeter.protocol.http.sampler.HTTPSamplerProxy.sample(HTTPSamplerProxy.java:66) ~[ApacheJMeter_http.jar:5.6.3]
	at org.apache.jmeter.protocol.http.sampler.HTTPSamplerBase.sample(HTTPSamplerBase.java:1311) ~[ApacheJMeter_http.jar:5.6.3]
	at org.apache.jmeter.protocol.http.sampler.HTTPSamplerBase.sample(HTTPSamplerBase.java:1300) ~[ApacheJMeter_http.jar:5.6.3]
	at org.apache.jmeter.threads.JMeterThread.doSampling(JMeterThread.java:651) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.threads.JMeterThread.executeSamplePackage(JMeterThread.java:570) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.threads.JMeterThread.processSampler(JMeterThread.java:501) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.threads.JMeterThread.run(JMeterThread.java:268) ~[ApacheJMeter_core.jar:5.6.3]
	at java.base/java.lang.Thread.runWith(Thread.java:1596) ~[?:?]
	at java.base/java.lang.Thread.run(Thread.java:1583) [?:?]
2025-03-29 04:24:55,972 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-16
2025-03-29 04:24:58,971 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-17
2025-03-29 04:25:01,972 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-18
2025-03-29 04:25:02,097 INFO o.a.j.r.Summariser: summary +     99 in 00:00:32 =    3.1/s Avg:  1075 Min:   188 Max:  5159 Err:     0 (0.00%) Active: 17 Started: 18 Finished: 1
2025-03-29 04:25:02,100 INFO o.a.j.r.Summariser: summary =    128 in 00:00:56 =    2.3/s Avg:   892 Min:   183 Max:  5159 Err:     0 (0.00%)
2025-03-29 04:25:04,972 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-19
2025-03-29 04:25:07,971 INFO o.a.j.t.JMeterThread: Thread started: Payload Stress Group (50 Users) 1-20
2025-03-29 04:25:14,072 INFO o.a.j.t.JMeterThread: Thread finished: Payload Stress Group (50 Users) 1-9
2025-03-29 04:25:14,073 ERROR o.a.j.JMeter: Uncaught exception in thread Thread[#35,Payload Stress Group (50 Users) 1-9,5,main]
java.lang.OutOfMemoryError: Java heap space
2025-03-29 04:25:25,470 INFO o.a.j.t.JMeterThread: Thread finished: Payload Stress Group (50 Users) 1-14
2025-03-29 04:25:25,471 ERROR o.a.j.JMeter: Uncaught exception in thread Thread[#40,Payload Stress Group (50 Users) 1-14,5,main]
java.lang.OutOfMemoryError: Java heap space
2025-03-29 04:25:28,679 INFO o.a.j.t.JMeterThread: Thread finished: Payload Stress Group (50 Users) 1-12
2025-03-29 04:25:28,680 ERROR o.a.j.JMeter: Uncaught exception in thread Thread[#38,Payload Stress Group (50 Users) 1-12,5,main]
java.lang.OutOfMemoryError: Java heap space
2025-03-29 04:25:32,864 INFO o.a.j.r.ResultCollector: Shutdown hook started
2025-03-29 04:25:32,869 INFO o.a.j.r.ResultCollector: Shutdown hook ended